Linux/LinuxOS/命令行trick.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<title>命令行trick</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="命令行trick"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-11-06 05:36:32 CST"/>
<meta name="author" content="visayafan"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>



</head>
<body>


<div id="content">
<h1 class="title">命令行trick</h1>


<script type="text/javascript" src="https://ajax.googleapis.com/ajax/libs/jquery/1.7.1/jquery.min.js"> </script>
<link rel="stylesheet" type="text/css" href="../../Layout/CSS/too_many_toc.css" />
<script src="../../Layout/JS/bootstrap_old.js"></script>


<p>
参考：<a href="http://blog.urfix.com/25-linux-commands/">http://blog.urfix.com/25-linux-commands/</a><br/>
</p>
<div id="table-of-contents">
<h2>目录</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 ls -</a></li>
<li><a href="#sec-2">2 cp filename{,.bak}</a></li>
<li><a href="#sec-3">3 !part-history-cmd:p</a></li>
<li><a href="#sec-4">4 &gt;filename</a></li>
<li><a href="#sec-5">5 Ctrl-x Ctrl-e</a></li>
<li><a href="#sec-6">6 !!</a></li>
<li><a href="#sec-7">7 !!:gs/old/new</a></li>
<li><a href="#sec-8">8 pushd/popd</a></li>
<li><a href="#sec-9">9 echo 换行</a></li>
<li><a href="#sec-10">10 递归更新目录下所有文件时间戳</a></li>
<li><a href="#sec-11">11 setsid, nohup, &amp; 后台执行命令</a></li>
<li><a href="#sec-12">12 分享/评论</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> ls -</h2>
<div class="outline-text-2" id="text-1">

<p>  返回上次所在目录<br/>
</p></div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> cp filename{,.bak}</h2>
<div class="outline-text-2" id="text-2">

<p>  快速进行文件备份<br/>
</p></div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> !part-history-cmd:p</h2>
<div class="outline-text-2" id="text-3">

<p>  !part-history-cmd将执行历史记录中第一次查找到的与其相符的命令，但为了以防万一，可以加上:p先打印出来看看而不执行。<br/>
  也可以用C-r来搜索历史命令。<br/>
</p></div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> &gt;filename</h2>
<div class="outline-text-2" id="text-4">

<p>   快速建立一个filename的文件，例如建立一个-rf的文件可以:<br/>
   也可以用touch<br/>
</p><blockquote>

<p>&gt;-rf<br/>
</p>
</blockquote>


</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Ctrl-x Ctrl-e</h2>
<div class="outline-text-2" id="text-5">

<p>  当在敲较长的命令时可以C-x C-e进入一个临时编辑器来编写命令，之后C-o ENTER C-x 退出<br/>
</p></div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> !!</h2>
<div class="outline-text-2" id="text-6">

<p>  执行上次命令<br/>
</p></div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> !!:gs/old/new</h2>
<div class="outline-text-2" id="text-7">

<p>  上次执行命令中old替换成new，例如上个命令为ls，执行!!:gs/s/l后等于执行ll，此命令对于较长的组合命令有时比较有效。<br/>
</p></div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> pushd/popd</h2>
<div class="outline-text-2" id="text-8">

<p>  pushd dit和popd，相当于一个堆栈,pushd dit的时候把当前目录压栈并切换到dit目录下,popd 返回上一次压栈的目录下。<br/>
</p></div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> echo 换行</h2>
<div class="outline-text-2" id="text-9">

<p>  直接 echo "a\nb" &gt;file 此时file中只有一行而非两行。<br/>
  使用-e选项表示解析转义，即 echo -e "a\nb" &gt;file 此时 file中有两行<br/>
</p></div>

</div>

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> 递归更新目录下所有文件时间戳</h2>
<div class="outline-text-2" id="text-10">




<pre class="example">find . -name "*.org" -exec touch {} \;
</pre>

</div>

</div>

<div id="outline-container-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> setsid, nohup, &amp; 后台执行命令</h2>
<div class="outline-text-2" id="text-11">

<p>  nohup cmd和cmd &amp;都可以使程序在后台执行，用jobs可以查看并可用kill来结束进程。<br/>
  setsid cmd 则新生成的进程脱离原来的进程组并成为新的进程组长。<br/>
  在我的.bashrc中有emacs别名：<br/>
</p><blockquote>

<p>alias e="setsid emacs &amp;"<br/>
</p>
</blockquote>


<p>
  这样在终端下e即可打开emacs，且当shell退出的时候emacs也不会跟着退出。<br/>
</p></div>

</div>

<div id="outline-container-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> 分享/评论</h2>
<div class="outline-text-2" id="text-12">


<a class="bshareDiv" href="http://www.bshare.cn/share">分享按钮</a><script type="text/javascript" charset="utf-8" src="http://static.bshare.cn/b/buttonLite.js#uuid=&amp;style=10&amp;bgcolor=Blue"></script>
<br/>
<script src="../../Layout/JS/disqus-comment.js"></script>
<div id="disqus_thread">
</div>

</div>
</div>
</div>

</body>
</html>
